spec/cassettes/StripeWrapper_Customer/_cancel_subscription/deletes_the_subscription.yml

---
http_interactions:
- request:
    method: get
    uri: https://api.stripe.com/v1/customers/cus_3o0HkagC8EB6f5
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Accept:
      - '*/*; q=0.5, application/xml'
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.10.1
      Authorization:
      - Bearer sk_test_YpTKVa3jAA45WGfOuoA9VvD5
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.10.1","lang":"ruby","lang_version":"2.0.0 p247 (2013-06-27)","platform":"universal.x86_64-darwin13","publisher":"stripe","uname":"Darwin
        macbook 13.1.0 Darwin Kernel Version 13.1.0: Thu Jan 16 19:40:37 PST 2014;
        root:xnu-2422.90.20~2/RELEASE_X86_64 x86_64"}'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Sun, 06 Apr 2014 23:46:23 GMT
      Content-Type:
      - application/json;charset=utf-8
      Content-Length:
      - '2233'
      Cache-Control:
      - no-cache, no-store
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Max-Age:
      - '300'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "object": "customer",
          "created": 1396821446,
          "id": "cus_3o0HkagC8EB6f5",
          "livemode": false,
          "description": null,
          "email": "testingpayments@leeduan.com",
          "delinquent": false,
          "metadata": {},
          "subscriptions": {
            "object": "list",
            "total_count": 1,
            "has_more": false,
            "url": "/v1/customers/cus_3o0HkagC8EB6f5/subscriptions",
            "data": [
              {
                "id": "sub_3o0HSbkpUj4PO6",
                "plan": {
                  "interval": "month",
                  "name": "Monthly Premium",
                  "created": 1395893965,
                  "amount": 999,
                  "currency": "usd",
                  "id": "5BimqrVQFoebM4eLi_ATcA",
                  "object": "plan",
                  "livemode": false,
                  "interval_count": 1,
                  "trial_period_days": null,
                  "metadata": {},
                  "statement_description": "Monthly MyFLiX"
                },
                "object": "subscription",
                "start": 1396821446,
                "status": "active",
                "customer": "cus_3o0HkagC8EB6f5",
                "cancel_at_period_end": false,
                "current_period_start": 1396821446,
                "current_period_end": 1399413446,
                "ended_at": null,
                "trial_start": null,
                "trial_end": null,
                "canceled_at": null,
                "quantity": 1,
                "application_fee_percent": null,
                "discount": null
              }
            ],
            "count": 1
          },
          "discount": null,
          "account_balance": 0,
          "currency": "usd",
          "cards": {
            "object": "list",
            "total_count": 1,
            "has_more": false,
            "url": "/v1/customers/cus_3o0HkagC8EB6f5/cards",
            "data": [
              {
                "id": "card_103o0H2ZsJylVlgJqOJc2868",
                "object": "card",
                "last4": "4242",
                "type": "Visa",
                "exp_month": 4,
                "exp_year": 2014,
                "fingerprint": "kiMCSaHezC1MyJis",
                "customer": "cus_3o0HkagC8EB6f5",
                "country": "US",
                "name": null,
                "address_line1": null,
                "address_line2": null,
                "address_city": null,
                "address_state": null,
                "address_zip": null,
                "address_country": null,
                "cvc_check": "pass",
                "address_line1_check": null,
                "address_zip_check": null
              }
            ],
            "count": 1
          },
          "default_card": "card_103o0H2ZsJylVlgJqOJc2868"
        }
    http_version: 
  recorded_at: Sun, 06 Apr 2014 23:46:23 GMT
- request:
    method: get
    uri: https://api.stripe.com/v1/customers/cus_3o0HkagC8EB6f5/subscriptions/sub_3o0HSbkpUj4PO6
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Accept:
      - '*/*; q=0.5, application/xml'
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.10.1
      Authorization:
      - Bearer sk_test_YpTKVa3jAA45WGfOuoA9VvD5
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.10.1","lang":"ruby","lang_version":"2.0.0 p247 (2013-06-27)","platform":"universal.x86_64-darwin13","publisher":"stripe","uname":"Darwin
        macbook 13.1.0 Darwin Kernel Version 13.1.0: Thu Jan 16 19:40:37 PST 2014;
        root:xnu-2422.90.20~2/RELEASE_X86_64 x86_64"}'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Sun, 06 Apr 2014 23:46:23 GMT
      Content-Type:
      - application/json;charset=utf-8
      Content-Length:
      - '753'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Max-Age:
      - '300'
      Access-Control-Allow-Credentials:
      - 'true'
      Cache-Control:
      - no-cache, no-store
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "id": "sub_3o0HSbkpUj4PO6",
          "plan": {
            "interval": "month",
            "name": "Monthly Premium",
            "created": 1395893965,
            "amount": 999,
            "currency": "usd",
            "id": "5BimqrVQFoebM4eLi_ATcA",
            "object": "plan",
            "livemode": false,
            "interval_count": 1,
            "trial_period_days": null,
            "metadata": {},
            "statement_description": "Monthly MyFLiX"
          },
          "object": "subscription",
          "start": 1396821446,
          "status": "active",
          "customer": "cus_3o0HkagC8EB6f5",
          "cancel_at_period_end": false,
          "current_period_start": 1396821446,
          "current_period_end": 1399413446,
          "ended_at": null,
          "trial_start": null,
          "trial_end": null,
          "canceled_at": null,
          "quantity": 1,
          "application_fee_percent": null,
          "discount": null
        }
    http_version: 
  recorded_at: Sun, 06 Apr 2014 23:46:23 GMT
- request:
    method: delete
    uri: https://api.stripe.com/v1/customers/cus_3o0HkagC8EB6f5/subscriptions/sub_3o0HSbkpUj4PO6
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Accept:
      - '*/*; q=0.5, application/xml'
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.10.1
      Authorization:
      - Bearer sk_test_YpTKVa3jAA45WGfOuoA9VvD5
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.10.1","lang":"ruby","lang_version":"2.0.0 p247 (2013-06-27)","platform":"universal.x86_64-darwin13","publisher":"stripe","uname":"Darwin
        macbook 13.1.0 Darwin Kernel Version 13.1.0: Thu Jan 16 19:40:37 PST 2014;
        root:xnu-2422.90.20~2/RELEASE_X86_64 x86_64"}'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Sun, 06 Apr 2014 23:46:24 GMT
      Content-Type:
      - application/json;charset=utf-8
      Content-Length:
      - '767'
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Cache-Control:
      - no-cache, no-store
      Access-Control-Max-Age:
      - '300'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "id": "sub_3o0HSbkpUj4PO6",
          "plan": {
            "interval": "month",
            "name": "Monthly Premium",
            "created": 1395893965,
            "amount": 999,
            "currency": "usd",
            "id": "5BimqrVQFoebM4eLi_ATcA",
            "object": "plan",
            "livemode": false,
            "interval_count": 1,
            "trial_period_days": null,
            "metadata": {},
            "statement_description": "Monthly MyFLiX"
          },
          "object": "subscription",
          "start": 1396821446,
          "status": "canceled",
          "customer": "cus_3o0HkagC8EB6f5",
          "cancel_at_period_end": false,
          "current_period_start": 1396821446,
          "current_period_end": 1399413446,
          "ended_at": 1396827984,
          "trial_start": null,
          "trial_end": null,
          "canceled_at": 1396827984,
          "quantity": 1,
          "application_fee_percent": null,
          "discount": null
        }
    http_version: 
  recorded_at: Sun, 06 Apr 2014 23:46:23 GMT
recorded_with: VCR 2.9.0
